PVO/src/Documents/РеализацияМероприятия/РеализацияМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияМероприятия</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСуммаПоМероприятию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПоЗакрывающимДокументам</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.Мероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PVO/src/Documents/РеализацияМероприятия/Forms/ФормаДокумента/Module.bsl
//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ДанныеПоЗакрывающимДокументамСуммаПриИзменении(Элемент)
	
	Объект.ИтоговаяСуммаПоМероприятию =Объект.ДанныеПоЗакрывающимДокументам.Итог("Сумма");
	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ДанныеПоЗакрывающимДокументамПередУдалением(Элемент, Отказ)  
	Объект.ИтоговаяСуммаПоМероприятию =Объект.ДанныеПоЗакрывающимДокументам.Итог("Сумма");
	//ВременнаяСтрока = Элементы.ДанныеПоЗакрывающимДокументам.ПодчиненныеЭлементы.ДанныеПоЗакрывающимДокументамСумма
	//Объект.ИтоговаяСуммаПоМероприятию = Объект.ИтоговаяСуммаПоМероприятию - Элементы.ДанныеПоЗакрывающимДокументамСумма.ТекстРедактирования	
//Объект.ИтоговаяСуммаПоМероприятию = Объект.ИтоговаяСуммаПоМероприятию - Объект.ДанныеПоЗакрывающимДокументам[0].Сумма;
КонецПроцедуры
